spec/cassettes/Credit_card_in_checkout_flow/with_existing_credit_card/with_multiple_credit_cards/chooses_different_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=suzi_goldner%40simonis.name&card[number]=4111111111111111&card[exp_month]=12&card[exp_year]=2019&card[cvc]=123&card[name]=First&card[address_line1]=10+Lovely+Street&card[address_line2]=Northwest&card[address_country]=NAME_5&card[address_zip]=35005&card[address_state]=STATE_NAME_5&card[address_city]=Herndon
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - Basic c2tfdGVzdF9WQ1puRHYzR0xVMTVUUnZuOGkyRXNhQU46
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.78.0
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.78.0","lang":"ruby","lang_version":"2.5.0 p0 (2017-12-25)","platform":"x86_64-darwin17","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 May 2018 22:50:24 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1485'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_teYZHccePBtAVT
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_CuveYIY3gJVvUL",
          "object": "customer",
          "account_balance": 0,
          "created": 1527115824,
          "currency": null,
          "default_source": "card_1CV5mm22AWtpwVQmNrtUK6cb",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "suzi_goldner@simonis.name",
          "invoice_prefix": "0BA11EC",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1CV5mm22AWtpwVQmNrtUK6cb",
                "object": "card",
                "address_city": "Herndon",
                "address_country": "NAME_5",
                "address_line1": "10 Lovely Street",
                "address_line1_check": "pass",
                "address_line2": "Northwest",
                "address_state": "STATE_NAME_5",
                "address_zip": "35005",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_CuveYIY3gJVvUL",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 12,
                "exp_year": 2019,
                "fingerprint": "nMGtzMc0CKPKDH0u",
                "funding": "unknown",
                "last4": "1111",
                "metadata": {},
                "name": "First",
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_CuveYIY3gJVvUL/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_CuveYIY3gJVvUL/subscriptions"
          }
        }
    http_version: 
  recorded_at: Wed, 23 May 2018 22:50:25 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=suzi_goldner%40simonis.name&card[number]=4111111111111111&card[exp_month]=12&card[exp_year]=2019&card[cvc]=123&card[name]=Second&card[address_line1]=10+Lovely+Street&card[address_line2]=Northwest&card[address_country]=NAME_5&card[address_zip]=35005&card[address_state]=STATE_NAME_6&card[address_city]=Herndon
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - Basic c2tfdGVzdF9WQ1puRHYzR0xVMTVUUnZuOGkyRXNhQU46
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.78.0
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.78.0","lang":"ruby","lang_version":"2.5.0 p0 (2017-12-25)","platform":"x86_64-darwin17","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 May 2018 22:50:26 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1486'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_tHkxexnQUkMUPs
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_CuveFsBzaS5fMu",
          "object": "customer",
          "account_balance": 0,
          "created": 1527115826,
          "currency": null,
          "default_source": "card_1CV5mo22AWtpwVQm77t3GcLK",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "suzi_goldner@simonis.name",
          "invoice_prefix": "6F8A250",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1CV5mo22AWtpwVQm77t3GcLK",
                "object": "card",
                "address_city": "Herndon",
                "address_country": "NAME_5",
                "address_line1": "10 Lovely Street",
                "address_line1_check": "pass",
                "address_line2": "Northwest",
                "address_state": "STATE_NAME_6",
                "address_zip": "35005",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_CuveFsBzaS5fMu",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 12,
                "exp_year": 2019,
                "fingerprint": "nMGtzMc0CKPKDH0u",
                "funding": "unknown",
                "last4": "1111",
                "metadata": {},
                "name": "Second",
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_CuveFsBzaS5fMu/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_CuveFsBzaS5fMu/subscriptions"
          }
        }
    http_version: 
  recorded_at: Wed, 23 May 2018 22:50:26 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_CuveFsBzaS5fMu/cards/card_1CV5mo22AWtpwVQm77t3GcLK
    body:
      encoding: UTF-8
      string: exp_month=12&exp_year=2019&name=Second&address_city=Herndon&address_country=US&address_state=STATE_ABBR_6&address_line1=10+Lovely+Street&address_line2=Northwest&address_zip=35005
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - Basic c2tfdGVzdF9WQ1puRHYzR0xVMTVUUnZuOGkyRXNhQU46
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.78.0
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.78.0","lang":"ruby","lang_version":"2.5.0 p0 (2017-12-25)","platform":"x86_64-darwin17","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 May 2018 22:50:30 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '626'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_GUMrnvMf5jb2mc
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "card_1CV5mo22AWtpwVQm77t3GcLK",
          "object": "card",
          "address_city": "Herndon",
          "address_country": "US",
          "address_line1": "10 Lovely Street",
          "address_line1_check": "pass",
          "address_line2": "Northwest",
          "address_state": "STATE_ABBR_6",
          "address_zip": "35005",
          "address_zip_check": "pass",
          "brand": "Visa",
          "country": "US",
          "customer": "cus_CuveFsBzaS5fMu",
          "cvc_check": "pass",
          "dynamic_last4": null,
          "exp_month": 12,
          "exp_year": 2019,
          "fingerprint": "nMGtzMc0CKPKDH0u",
          "funding": "unknown",
          "last4": "1111",
          "metadata": {},
          "name": "Second",
          "tokenization_method": null
        }
    http_version: 
  recorded_at: Wed, 23 May 2018 22:50:30 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_CuveFsBzaS5fMu/cards/card_1CV5mo22AWtpwVQm77t3GcLK
    body:
      encoding: UTF-8
      string: exp_month=12&exp_year=2019&name=Second&address_city=Herndon&address_country=US&address_state=STATE_ABBR_6&address_line1=10+Lovely+Street&address_line2=Northwest&address_zip=35005
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - Basic c2tfdGVzdF9WQ1puRHYzR0xVMTVUUnZuOGkyRXNhQU46
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.78.0
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.78.0","lang":"ruby","lang_version":"2.5.0 p0 (2017-12-25)","platform":"x86_64-darwin17","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 May 2018 22:50:32 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '626'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8WqUYpDEkKzcKV
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "card_1CV5mo22AWtpwVQm77t3GcLK",
          "object": "card",
          "address_city": "Herndon",
          "address_country": "US",
          "address_line1": "10 Lovely Street",
          "address_line1_check": "pass",
          "address_line2": "Northwest",
          "address_state": "STATE_ABBR_6",
          "address_zip": "35005",
          "address_zip_check": "pass",
          "brand": "Visa",
          "country": "US",
          "customer": "cus_CuveFsBzaS5fMu",
          "cvc_check": "pass",
          "dynamic_last4": null,
          "exp_month": 12,
          "exp_year": 2019,
          "fingerprint": "nMGtzMc0CKPKDH0u",
          "funding": "unknown",
          "last4": "1111",
          "metadata": {},
          "name": "Second",
          "tokenization_method": null
        }
    http_version: 
  recorded_at: Wed, 23 May 2018 22:50:32 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: card=card_1CV5mo22AWtpwVQm77t3GcLK&amount=1999&currency=usd&description=Spree+Order+ID%3A+R421072212-PX2Q7199&payment_user_agent=Stripe%2Fv1+ActiveMerchantBindings%2F1.78.0&customer=cus_CuveFsBzaS5fMu&capture=false
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - Basic c2tfdGVzdF9WQ1puRHYzR0xVMTVUUnZuOGkyRXNhQU46
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.78.0
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.78.0","lang":"ruby","lang_version":"2.5.0 p0 (2017-12-25)","platform":"x86_64-darwin17","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 May 2018 22:50:34 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1829'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_f4hH67Ktf7OcyT
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_1CV5mv22AWtpwVQmmbbEAzZj",
          "object": "charge",
          "amount": 1999,
          "amount_refunded": 0,
          "application": null,
          "application_fee": null,
          "balance_transaction": null,
          "captured": false,
          "created": 1527115833,
          "currency": "usd",
          "customer": "cus_CuveFsBzaS5fMu",
          "description": "Spree Order ID: R421072212-PX2Q7199",
          "destination": null,
          "dispute": null,
          "failure_code": null,
          "failure_message": null,
          "fraud_details": {},
          "invoice": null,
          "livemode": false,
          "metadata": {},
          "on_behalf_of": null,
          "order": null,
          "outcome": {
            "network_status": "approved_by_network",
            "reason": null,
            "risk_level": "normal",
            "seller_message": "Payment complete.",
            "type": "authorized"
          },
          "paid": true,
          "receipt_email": null,
          "receipt_number": null,
          "refunded": false,
          "refunds": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/charges/ch_1CV5mv22AWtpwVQmmbbEAzZj/refunds"
          },
          "review": null,
          "shipping": null,
          "source": {
            "id": "card_1CV5mo22AWtpwVQm77t3GcLK",
            "object": "card",
            "address_city": "Herndon",
            "address_country": "US",
            "address_line1": "10 Lovely Street",
            "address_line1_check": "pass",
            "address_line2": "Northwest",
            "address_state": "STATE_ABBR_6",
            "address_zip": "35005",
            "address_zip_check": "pass",
            "brand": "Visa",
            "country": "US",
            "customer": "cus_CuveFsBzaS5fMu",
            "cvc_check": "pass",
            "dynamic_last4": null,
            "exp_month": 12,
            "exp_year": 2019,
            "fingerprint": "nMGtzMc0CKPKDH0u",
            "funding": "unknown",
            "last4": "1111",
            "metadata": {},
            "name": "Second",
            "tokenization_method": null
          },
          "source_transfer": null,
          "statement_descriptor": null,
          "status": "succeeded",
          "transfer_group": null
        }
    http_version: 
  recorded_at: Wed, 23 May 2018 22:50:34 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_CuveFsBzaS5fMu/cards/card_1CV5mo22AWtpwVQm77t3GcLK
    body:
      encoding: UTF-8
      string: exp_month=12&exp_year=2019&name=Second&address_city=Herndon&address_country=US&address_state=STATE_ABBR_6&address_line1=10+Lovely+Street&address_line2=Northwest&address_zip=35005
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - Basic c2tfdGVzdF9WQ1puRHYzR0xVMTVUUnZuOGkyRXNhQU46
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.78.0
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.78.0","lang":"ruby","lang_version":"2.5.0 p0 (2017-12-25)","platform":"x86_64-darwin17","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 May 2018 22:50:35 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '626'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_5G2MLi21fVyO10
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "card_1CV5mo22AWtpwVQm77t3GcLK",
          "object": "card",
          "address_city": "Herndon",
          "address_country": "US",
          "address_line1": "10 Lovely Street",
          "address_line1_check": "pass",
          "address_line2": "Northwest",
          "address_state": "STATE_ABBR_6",
          "address_zip": "35005",
          "address_zip_check": "pass",
          "brand": "Visa",
          "country": "US",
          "customer": "cus_CuveFsBzaS5fMu",
          "cvc_check": "pass",
          "dynamic_last4": null,
          "exp_month": 12,
          "exp_year": 2019,
          "fingerprint": "nMGtzMc0CKPKDH0u",
          "funding": "unknown",
          "last4": "1111",
          "metadata": {},
          "name": "Second",
          "tokenization_method": null
        }
    http_version: 
  recorded_at: Wed, 23 May 2018 22:50:35 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_CuveFsBzaS5fMu/cards/card_1CV5mo22AWtpwVQm77t3GcLK
    body:
      encoding: UTF-8
      string: exp_month=12&exp_year=2019&name=Second&address_city=Herndon&address_country=US&address_state=STATE_ABBR_6&address_line1=10+Lovely+Street&address_line2=Northwest&address_zip=35005
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - Basic c2tfdGVzdF9WQ1puRHYzR0xVMTVUUnZuOGkyRXNhQU46
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.78.0
      Stripe-Version:
      - '2015-04-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.78.0","lang":"ruby","lang_version":"2.5.0 p0 (2017-12-25)","platform":"x86_64-darwin17","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 May 2018 22:50:37 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '626'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_Y6uDt1tR1yDCXP
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "card_1CV5mo22AWtpwVQm77t3GcLK",
          "object": "card",
          "address_city": "Herndon",
          "address_country": "US",
          "address_line1": "10 Lovely Street",
          "address_line1_check": "pass",
          "address_line2": "Northwest",
          "address_state": "STATE_ABBR_6",
          "address_zip": "35005",
          "address_zip_check": "pass",
          "brand": "Visa",
          "country": "US",
          "customer": "cus_CuveFsBzaS5fMu",
          "cvc_check": "pass",
          "dynamic_last4": null,
          "exp_month": 12,
          "exp_year": 2019,
          "fingerprint": "nMGtzMc0CKPKDH0u",
          "funding": "unknown",
          "last4": "1111",
          "metadata": {},
          "name": "Second",
          "tokenization_method": null
        }
    http_version: 
  recorded_at: Wed, 23 May 2018 22:50:37 GMT
recorded_with: VCR 4.0.0
